[
  {
    "pageNumber": 5,
    "text": "Student Handbook & Calendar 2025-2026 Trailblazer Success (828) 398-7900 • ABTECH.EDU Sponsored by the Student Life & Development Department & the Student Government Association Changing Lives • Strengthening Communities. Dear Students, Whether you are preparing yourself for a better job, a new career or a step toward a four-year university, our mission is to help you along your path. We want your experience with A-B Tech to be positive and productive, as well as to make you feel that you are part of a community that makes you feel inspired, valued, and safe. A-B Tech is a welcoming college where our faculty and staff care about you. Our college is designed to provide the resources you need to be successful in your educational endeavors. Your instructors have a support team that includes academic and financial aid advisors, success coaches, counselors, the Academic Achievement Center, Vet - erans Services, Student Life, and much more. We are all here because we want you to succeed! Please take advan - tage of these resources and do not hesitate to contact me or other A-B Tech employees if you have questions, comments, or concerns. We welcome your input and feedback. Wishing you every success in the 2025-2026 academic year, Dr. John Gossett President Accreditation Asheville-Buncombe Technical Community College is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award associate degrees. Asheville-Buncombe Tech - nical Community College also may offer credentials such as certificates and diplomas at approved degree levels. Questions about the accreditation of Asheville-Buncombe Technical Community College may be directed in writing to the Southern Association of Colleges and Schools Commission on Colleges at 1866 Southern Lane, Decatur, GA 30033-4097, by calling (404) 679-4500, or by using information available on SACSCOC’s website (www.sacscoc.org). Equal Opportunity Educational Institution. Mission Statement Dedicated to the success of students and communities, Asheville-Buncombe Technical Community College provides meaningful teaching and learning in a curriculum, continuing education, and workforce development environment committed to Respect, Integrity, Support, and Equity (RISE). We welcome everyone to join us. Vision Statement Changing Lives • Strengthening Communities Values Excellence Learning Supportive Environment Innovation Inclusiveness Continuous Improvement Non-Discrimination Statement The A-B Tech Board of Trustees and Administration are fully committed to encouraging and sustaining a learning and work environment that is free from prohibited discrimination. The College does not practice or condone discrimination based on race, color, national origin, religion, sex, sexual orientation, gender identity or expression, pregnancy, disability, genetic information/medical history, age, political affiliation, or veterans’ status in the administration of any of its academic programs and employment practices. 1 • 2025-2026 Student Handbook and Calendar. Your Path to Success Starts Here Welcome to A-B Tech! We’re so glad you’re here.",
    "estimatedTokens": 786
  },
  {
    "pageNumber": 6,
    "text": "or, national origin, religion, sex, sexual orientation, gender identity or expression, pregnancy, disability, genetic information/medical history, age, political affiliation, or veterans’ status in the administration of any of its academic programs and employment practices. 1 • 2025-2026 Student Handbook and Calendar. Your Path to Success Starts Here Welcome to A-B Tech! We’re so glad you’re here. A B Tech is your college — a place where you belong, your goals matter, and your potential is supported every step of the way. Whether you’re pursuing a degree, building career skills, or preparing for transfer, you’re now part of a vibrant College community. The Student Life and Development Department, along with the Student Government Association (SGA), is excited to offer a wide range of programs and activities during the 2025–2026 academic year. From leadership programs to service projects and social events, there’s something here for everyone. Student Life and Development exists to help you thrive beyond the classroom — offering experiences that support personal growth, leadership development, and community engagement. Through campus programming, we aim to build a student-centered campus culture where you feel seen, supported, and empowered. Make the most of your time here by joining a club or start your own; participate in volunteer service in the community; play intramural sports; attend campus events and leadership workshops; or step into a student leadership role. Stay up-to-date with our weekly Trailblazer Talk e-newsletter and visit abtech.edu/student-life for upcoming events, student opportunities, and ways to connect. The Student Life & Development offices are located in the Coman Student Center — stop by and say hello! A-B TEC H 2025-2026 Student Handbook and Calendar • 2. 3 • 2025-2026 Student Handbook and Calendar Table of Contents Welcome & Introduction Non-Discrimination Statement ............................. 1 Getting Started.............. ............ ............................4 Hours of Operation....... ........... ..............................5 Tuition and Fees.................... ........... .....................5 College Essentials Student ID Cards................ ........... ........................6 Student Parking Decals ......................................... 6 A-B Tech Police Department ................................. 6 Bookstore........................... ............ .......................8 Career Services...................................... .... ...........9 College Services and Supports Accommodations for Students with Disabilities .. 9 Americans with Disabilities Act Compliance............................ ................... ...........10 Veterans’ Service Office............ .......... ................10 Addiction, Recover, and Coping (ARC) ................ 11 The RESET ........................................................... 11 Safe Zone ............................................................ 11 Financial Aid........................ .......... ......................12 Bank. Mobile Card............ .................",
    "estimatedTokens": 780
  },
  {
    "pageNumber": 6,
    "text": ".....10 Veterans’ Service Office............ .......... ................10 Addiction, Recover, and Coping (ARC) ................ 11 The RESET ........................................................... 11 Safe Zone ............................................................ 11 Financial Aid........................ .......... ......................12 Bank. Mobile Card............ ................. ....................13 Health Clinic ........................................................ 21 Dental Clinic ........................................................ 21 Mountain Tech Spa ............................................. 21 Sustainability ...................................................... 22 Academic Support Counseling Services .............................................. 9 Don C. Locke Library ............................................ 22 Academic Resources and Advising ..................... 22 Quality Enhancement Plan (QEP) ......................... 24 Student Services for Distance Learners ............. 24 A-B Tech Guidelines Wildlife on Campus ............................................... 8 Campus Visitors, Including Children in the Classrooms......................... ......................... ........11 Dress and Personal Appearance................... ......12 Vaping, E-cigarettes, and Tobacco Free Campus..................... ............................... ............12 Inclement Weather Schedule........ ......... ............16 Academic Procedures Auditing Courses......................... ......... ...............13 Schedule Adjustments................... ......... ............14 Class Attendance............................. ......... ..........15 Prerequisites and Corequisites......... ......... .........26 Course Substitution.......................... .......... .........26 Introduction to College Courses for Degree-Seeking Students ................................... 27 Work-Based Learning................ ........... ...............27 Independent Study.......................... ......... ...........27 Max Course Load........................... ......... ............28 Transfer Credit.............................. .......... .............28 Academic Fresh Start................... .......... .............29 Transcripts..................................... ......... .............29 Credit by Examination........................ ......... ........29 Curriculum Course Repetition........... ......... .........30 Final Evaluations................................... . .............31 Program Completion and Commencement ......... 31 Grading System........................ ......... ..................32 To Compute the Quality Point Average ............... 33 Student Life Student Government Assoc.......... ......... .............17 The Student’s Role in Institutional Decision Making................... .............. ................18 Student Activity Fee Usage............. .......... ..........18 Student Intramurals....................... ......... ............18 Forming Clubs/Societies........ ................. ............18 Student Clubs/Societies......... ................",
    "estimatedTokens": 787
  },
  {
    "pageNumber": 8,
    "text": "rnment Assoc.......... ......... .............17 The Student’s Role in Institutional Decision Making................... .............. ................18 Student Activity Fee Usage............. .......... ..........18 Student Intramurals....................... ......... ............18 Forming Clubs/Societies........ ................. ............18 Student Clubs/Societies......... ................ ............19 Entrepreneurial Resources for Students.............21 Food Options on Campus .................................... 21 Dining with Culinary Arts Program ..................... 22 Student Food Pantry ............................................ 22 Honors and Achievements .................................. 28 College Policies and Procedures Student Rights and Responsibilities ................... 33 Policies and Procedures ...................................... 34 College Calendar ............................................. 35. 2025-2026 Student Handbook and Calendar • 4 Getting Started A-B Tech Information Center - (828) 398-7900 Accident Insurance - 398-7109 Admissions - 398-7886 - New Student Orientation - Residency for Tuition Purposes - Selective Programs Child Care Assistance - 398-7143 Financial Aid - 398-7596 - Grants and Scholarships - Work-Study Jobs - Loans Testing Center - 398-7219 - Placement Testing - Testing for Accommodations - Test of Essential Academic Skills (TEAS) Records and Registration- 398-7900 - Official Withdrawals - Transcript Requests - Registration Information - Name Changes - Program Completion - Transcript Evaluations Academic Advising - 398-7900 - English and Math Placement - Add or Change Major - International Student Advising - Limited/Selective Program Advising - Transfer Program Questions Support Services - 398-7900 - Personal Counseling - Career Counseling - Accommodations for Disabilities - Veterans’ Services - Student Resources Bookstore - 398-7227 - Textbooks and Supplies - Convenience Store - A-B Tech Logo Merchandise Business Office - 398-7152 - Charges and Payments - Payment Plans - Sponsored Student Transactions Police Department - 828-398-7125 - Crimes in Progress - Completed Crimes: Assaults, Larcenies, Vandalism, etc. - Traffic Accidents - Lost and Found - Stolen Items - Dead Batteries - Keys Locked in Car - Medical Emergencies and Injuries For emergencies call - 398-7125 or 9-911 Student Life & Development 398-7594, 398-7205, 398-7203 - Student Activities and Events - Student Organizations - Student Government Association - Student Leadership Programs Reporting Title IX & Sexual Misconduct - 398-7932 Reporting Discrimination or Harassment – 398-7143. 5 • 2025-2026 Student Handbook and Calendar Hours of Operations *Hours are subject to change Center for Academic Achievement: (Locke) Mon-Thu: 9 a.m.- 6 p.m. Fri: 9 a.m.- 2 p.m. (in-person & online) Sat-Sun: 1 p.m. - 8 p.m. (online only) Testing Center (Bailey): Mon - Thu: 8:30 a.m. - 5 p.m. Fri: 8:30 a.m. - 2 p.m. Basketball & Weight Room (Coman): Posted in gym and online each semester Bookstore (Bailey): Mon-Thu: 9 a.m.- 5 p.m. Fri: 9 a.m.- 2 p.m. Business Office Hours (Roberson): Mon-Thu: 9 a.m.- 5 p.m. Fri: 9 a.m. - 2 p.m.",
    "estimatedTokens": 796
  },
  {
    "pageNumber": 9,
    "text": ") Mon-Thu: 9 a.m.- 6 p.m. Fri: 9 a.m.- 2 p.m. (in-person & online) Sat-Sun: 1 p.m. - 8 p.m. (online only) Testing Center (Bailey): Mon - Thu: 8:30 a.m. - 5 p.m. Fri: 8:30 a.m. - 2 p.m. Basketball & Weight Room (Coman): Posted in gym and online each semester Bookstore (Bailey): Mon-Thu: 9 a.m.- 5 p.m. Fri: 9 a.m.- 2 p.m. Business Office Hours (Roberson): Mon-Thu: 9 a.m.- 5 p.m. Fri: 9 a.m. - 2 p.m. Financial Aid (Bailey): Mon-Thu: 8:30 a.m.- 5 p.m. Fri: 8:30 a.m.- 2 p.m. Don C. Locke Library: Mon & Thu: 8 a.m.- 7 p.m. Tues & Wed: 8 a.m. - 6 p.m. Fri: 8 a.m.- 4 p.m. Student Services (Bailey): Mon-Thu: 8:30 a.m.- 5 p.m. Fri: 8:30 a.m.- 2 p.m. Tuition and Fees* Fall, Spring, and Summer Semesters North Carolina Residents: N.C. resident per semester $1,216.00 (16 or more credit hours), N.C. resident per credit hour per semester $76.00 (15 or fewer credit hours) Nonresidents: Nonresident of N.C. per semester $4,288.00 (16 or more credit hours), Nonresident of N.C. per credit hour per semester $268.00 (15 or fewer credit hours) Fees: Accident Insurance: up to $2 A group policy, providing supplemental accident insurance, is maintained by the College and students are required to subscribe to such coverage. Activity Fee, Fall and Spring Semesters: The student activity fee of $40 will be charged to online students and those enrolled on the A-B Tech main campus during the fall and spring semesters. Early College students are excluded from fee. Individual course fees: Selected courses will have additional fees assessed. Computer Use and Technology Fee: $48.00 per semester CAPS (Campus Access, Parking and Security) Fee: $30.00 per semester Matriculation Fee : $20 per semester *All tuition and fees are subject to change without notice. Some fees may not be charged for 100% online or off-campus students. Fees are not refundable for classes dropped after the term begins. 2025-2026 Student Handbook and Calendar • 6 Student ID Cards Students are encouraged to order a student ID card online for later pick up. Information about ordering an ID card can be found online at abtech.edu/studentidcards. To be eligible for a student ID, you will need to be registered in classes, present a valid driver’s license or other government-issued photo ID and have a student ID number. The first ID card is free, but replacement cards are $10. Replacement fees can be paid in the Roberson Building or online at abtech.edu/student-services/student-id-cards . A-B Tech student identification cards have been approved by the State Board of Elections to be used as photo identification for voting in the primary and general elections in North Caroli - na. More information about voting can be found at ncsbe.gov/voting/voter-id . Student Parking Decals Student parking decals are limited to students participating in face-to-face, in-person classes. A vehicle registration form is available online at abtech.edu/parking-decals. Students may also obtain a parking decal at the Police Department located in the Mission Health/A-B Tech Conference Center.",
    "estimatedTokens": 762
  },
  {
    "pageNumber": 10,
    "text": "na. More information about voting can be found at ncsbe.gov/voting/voter-id . Student Parking Decals Student parking decals are limited to students participating in face-to-face, in-person classes. A vehicle registration form is available online at abtech.edu/parking-decals. Students may also obtain a parking decal at the Police Department located in the Mission Health/A-B Tech Conference Center. Students should bring their vehicle information, including make, model, and year of the vehicle to be registered, in addition to the license plate number and state. To facilitate the process, students should also bring their Student ID Number. Any vehicle parked on campus must have a current parking decal. Student parking decals are valid from August through July and must be renewed by the start of the fall semester each year. Learn more about parking regulations, including where to display your parking decal. Students needing special parking should apply for a temporary handicapped placard through the North Carolina Division of Motor Vehicles. A-B Tech does not issue special parking permits. Parking spaces for individuals with disabilities are located at each facility. Spaces marked by yellow lines are for faculty and staff use only. Students park in white-lined spaces. All parking fines must be paid prior to registering for classes or getting transcripts. Note: Handicapped parking violations are charged on NC state citations and must be addressed through the Buncombe County Clerk of Court. A-B Tech Police Department The Department’s mission is to serve the College in a professional and courteous manner and to enforce State and local laws and College codes of conduct fairly and impartially. The primary function is to provide an environment that allows students, staff, faculty and vis - itors to interact in safe and secure surroundings. The Department’s role is to actively support the educational activities of the College through crime prevention, law enforcement, safety, security, traffic and parking services. The Police Department will strive to provide these services in a manner that will meet the highest level of approval and will constantly endeavor to anticipate the needs of the College community. The A-B Tech Police Department employs both sworn police officers and non-sworn security officers. Police officers are state certified and have full authority to enforce state and local laws and to make arrests on all A-B Tech campuses and properties. Both police and security officers are authorized to issue A-B Tech campus citations and make disciplinary referrals for violations of College parking and traffic regulations and Code of Student Conduct. 7 • 2025-2026 Student Handbook and Calendar Telephone Numbers for Police Services • Main College: 828-398-7900 (non-emergency number) • Police: 828-398-7125 • Emergency: 828-398-7125 or 9-911 Safety Tips Help prevent crimes from occurring on campus, at work, or just about anywhere by following these safety tips: Be Prepared • Always be alert and aware of the people around you. • Educate yourself concerning prevention tactics.",
    "estimatedTokens": 780
  },
  {
    "pageNumber": 11,
    "text": "k and Calendar Telephone Numbers for Police Services • Main College: 828-398-7900 (non-emergency number) • Police: 828-398-7125 • Emergency: 828-398-7125 or 9-911 Safety Tips Help prevent crimes from occurring on campus, at work, or just about anywhere by following these safety tips: Be Prepared • Always be alert and aware of the people around you. • Educate yourself concerning prevention tactics. • Be aware of locations and situations that would make you vulnerable to crime, such as alleys and dark parking lots. Street and Parking Lot Precautions • Whenever possible, travel with someone. • Stay in well-lit areas as much as possible. • Walk close to the curb. Avoid bushes and alleys where someone could hide. • If you carry a purse, hold it securely between your arm and body. • Walk confidently and at a steady pace. Car Safety • ALWAYS lock your car doors after entering or leaving your car. • Park in well-lit areas. • Don’t leave valuables in plain view. Lock valuables in the trunk, if possible, before arriving on campus. • Have your car keys in your hand before you get to your car. • Check the back seat before entering your car. • If you think you are being followed, drive to a security, police, sheriff or fire station. • Don’t stop to aid motorists stopped on the side of the road. Phone and request help for them. • Never pick up hitchhikers. Office and Classroom Safety • Never leave your purse or billfold in plain view or in the pocket of a jacket hanging on a door or chair. • Don’t leave cash or valuables in the office or classroom, even for a short time, such as a break. • Always lock your office when left unattended, no matter how quickly you plan to return. • Be aware of escape routes for emergencies. • Report suspicious people and activities to security personnel. • When sitting in the cafeteria, lounge or on outside benches, always keep personal belongings with you. • If you work alone or before/after normal business hours, keep the door locked. • If you attend night classes or work late, try to walk out with another person or call security for an escort. If a Crime Occurs - Report It Everyone should consider it his or her responsibility to report crime. Many criminals target. 2025-2026 Student Handbook and Calendar • 8 favorite areas and have predictable methods of operation. At least one out of two crimes in the United States goes unreported, usually because people don’t want to get involved. If you don’t report a crime, this allows the criminal to continue to operate without interference. In many cases, it is the information provided by victims and witnesses that leads to the arrest of a criminal. So, tell as much as you can; no fact is too trivial. Crime statistics for A-B Tech are posted annually on the US Department of Education, Office of Postsecondary Education’s web site at ope.ed.gov/security/ . For a copy of the A-B Tech Annual Security Report, please visit abtech.edu/security-reporting . The next annual report will be published October 2025. Wildlife on Campus A-B Tech is home to a diverse array of plants, birds, mammals, reptiles, and amphibians. Fox, deer, snakes, turtles, turkeys, and bears pass through campus regularly.",
    "estimatedTokens": 800
  },
  {
    "pageNumber": 12,
    "text": "of Postsecondary Education’s web site at ope.ed.gov/security/ . For a copy of the A-B Tech Annual Security Report, please visit abtech.edu/security-reporting . The next annual report will be published October 2025. Wildlife on Campus A-B Tech is home to a diverse array of plants, birds, mammals, reptiles, and amphibians. Fox, deer, snakes, turtles, turkeys, and bears pass through campus regularly. Please be respectful of our wild neighbors by not approaching or feeding the wildlife. If you spot a bear on cam - pus, please notify the A-B Tech Police Department so they can divert people from the area for everyone’s safety. They can be reached at 828-398-7125. To learn more about the Bear. Wise program and bear behavior, visit A-B Tech: Home to Students and Wildlife . Bookstore Students may purchase textbooks, classroom supplies, art supplies, College apparel and convenience store snacks and drinks from the College Bookstore in the K. Ray Bailey Student Services Center. Used books are available on a first-come, first-served basis. Payment may be made by financial aid, cash, check, Visa, Master. Card or American Express. Financial Aid is only available for a limited time at the beginning of each semester. The Bookstore offers contactless pickup, when space is available, for online orders through our pickup lockers located outside the Bailey building entrance closest to the bookstore. For more information, please visit bookstore.abtech.edu . Hours of Operation: Monday-Thursday: 9 a.m.- 5 p.m.; Friday: 9 a.m.- 2 p.m. Return Policy: All returns or exchanges must be accompanied by a sales receipt. There are no exceptions. If purchased new, textbooks must still be in new and resalable condition (any bundled access codes must not have been used). Defective books will be exchanged if returned within 7 days from the beginning of classes. Purchases paid for by check will be refunded by cash 15 days after the date of purchase. Credit card purchases will be credited back to the account and cash purchases will be refunded by cash. Financial Aid returns must be credited back to the student account. 9 • 2025-2026 Student Handbook and Calendar Career Services Career Counseling Need assistance choosing your college major/career path, preparing for interviews, or resume writing. Visit the Support Services department in the K. Ray Bailey Building or schedule a Career appointment at abtech.edu/careers . Career Coach Employers are looking for A-B Tech students and graduates. Career Coach hosts preferred local employers’ job postings. Jobs are posted for A-B Tech students, graduates, and the general public. Visit abtech.lightcastcc.com and click on Work Opportunities to view jobs posted for our area. Career Clothes Corner Student Services - Bailey Building Room 053 Monday-Thursday 8:30 a.m. - 5:00 p.m.; Friday 8:30 a.m. - 2 p.m. Do you need professional clothes for an interview or a job but don’t have any money for new clothes? Come to the Career Clothes Corner in Student Services and “shop” for FREE. All items provided are ready to wear. We have a variety of sizes, styles, and items including shoes and accessories.",
    "estimatedTokens": 787
  },
  {
    "pageNumber": 13,
    "text": "tudent Services - Bailey Building Room 053 Monday-Thursday 8:30 a.m. - 5:00 p.m.; Friday 8:30 a.m. - 2 p.m. Do you need professional clothes for an interview or a job but don’t have any money for new clothes? Come to the Career Clothes Corner in Student Services and “shop” for FREE. All items provided are ready to wear. We have a variety of sizes, styles, and items including shoes and accessories. Counseling Services A-B Tech provides free, confidential counseling and related services for enrolled students in the K. Ray Bailey Building. Students are encouraged to use counseling services at any time if they have personal, academic, or career concerns. The professional counseling staff, after initial assessment, will refer students who need specialized or long-term services to appropri - ate resources within the community. Students may email supportservices@abtech.edu or call 398-7536 to schedule an appointment. The Talk. Campus community offers valuable advice, resources, and coping skills from students who have been through similar situations. Download Talk. Campus now to speak openly about your mental well-being, and to support others in a non-judgmental environment. Sign up at talkcampus.com/sign-up . Child Care Assistance for Students Childcare assistance is available through the Office of the Vice President for Student Services. For more information, contact Kim England at 398-7143 or kimberlyhengland@abtech.edu. Accommodations for Students with Disabilities A-B Tech is invested in full compliance with Section 504 of the Rehabilitation Act of 1973 and the Americans with Disabilities Act of 1990. Support Services at the College ensures that the program and facilities of the College are accessible to all students. The College focuses on the student as an individual and works toward equal opportunity, full integration into the campus environment, physical accessibility and the provision of reasonable accommodations, auxiliary aids and services to students. Students with disabilities who require the services of ASL interpreters, readers or need other reasonable accommodations should request these services from Support Services, since. 2025-2026 Student Handbook and Calendar • 10 federal law prohibits the College from making pre-admission inquiries about disabilities. In order to accommodate each disabled student’s needs and to provide the necessary support services, a request for accommodations and professional documentation of a disability(ies) must be provided through Support Services. All forms are located online at abtech.edu/sup - portservices. Information provided by students is voluntary and appropriate confidentiality is maintained. Services are designed and developed on an individual basis, and students may elect to use any or all of the services appropriate to their needs at no charge. An appointment with the Support Services staff is needed in order to discuss any special concerns. Students who are not satisfied with the decisions of this office may utilize the Col - lege’s student appeals policy. For detailed information, refer to: abtech.edu/supportservices , call 828-398-7141, or email supportservices@abtech.edu .",
    "estimatedTokens": 797
  },
  {
    "pageNumber": 14,
    "text": "all of the services appropriate to their needs at no charge. An appointment with the Support Services staff is needed in order to discuss any special concerns. Students who are not satisfied with the decisions of this office may utilize the Col - lege’s student appeals policy. For detailed information, refer to: abtech.edu/supportservices , call 828-398-7141, or email supportservices@abtech.edu . This office is located in the K. Ray Bailey Student Services Center. Americans with Disabilities Act Compliance Individuals wishing to file a complaint of alleged discrimination on the basis of disability should contact the Office of the Vice President for Student Services at 398-7143. For more information regarding disabilities, view the College website at abtech.edu/supportservices . Student Resources A Student Resource guide can be found in K. Ray Bailey Student Service Center and online at abtech.edu/student-resources-guide . Other resource search engines such as 2-1-1, findhelp ( nccommunitycolleges.findhelp.com ), and NCCARE360 ( nccare360.org ) can help students locate a variety of resources such as food, health care, etc. Please email supportservices@abtech.edu for more information. Veterans’ Service Office The Veterans’ Services Coordinator helps veterans process their requests for benefits. The Veterans’ Office is located in the K. Ray Bailey Student Services Center. Individuals applying for Veteran’s benefits must meet all entrance requirements and are required to meet the College’s Standards of Academic Progress as they progress through their programs. Failure to meet these standards will result in loss of Veteran’s educational benefits. The Veterans’ Coordinator can be reached at veteranservices@abtech.edu and 828-398-7206. For more information, please visit abtech.edu/veterans . Vet Café Located in Ferguson 108 and open Monday through Friday 9 a.m. to 5 p.m., the Vet Cafe is a safe, comfortable place on campus for veterans to network, study, relax, and get connected with resources. Computers are available. For more information, visit abtech.edu/student-resources/veterans-services/veterans-cafe . 11 • 2025-2026 Student Handbook and Calendar Addiction, Recovery, and Coping (ARC) Students who are in recovery or desire to be in recovery from a substance use disorder can access services through Support Services. In addition to the annual ARC event in the spring, a Collegiate Recovery Program is also available year-round. Support, resources, and educational materials are available during regular business hours. VAYA Health can also be utilized to locate appropriate support in the community at 1-800-849-6127 (24/7 toll free). More informa - tion and resources can be found at abtech.edu/arc or contact Support Services at 828-398- 7536 or supportservices@abtech.edu . The RESET To better support our students, Support Services offers The RESET in ELM Room 204. This is a place for students struggling with mental health, addiction, and recovery to come and press the pause button to reset and cope with life. The room is open Monday through Friday from 9 a.m. to 5 p.m.",
    "estimatedTokens": 780
  },
  {
    "pageNumber": 15,
    "text": "und at abtech.edu/arc or contact Support Services at 828-398- 7536 or supportservices@abtech.edu . The RESET To better support our students, Support Services offers The RESET in ELM Room 204. This is a place for students struggling with mental health, addiction, and recovery to come and press the pause button to reset and cope with life. The room is open Monday through Friday from 9 a.m. to 5 p.m. If you have any questions, please contact supportservices@abtech.edu or (828) 398-7536. Safe Zone - LGBTQIA+ A-B Tech is a participant in the Safe Zone program, which seeks to create a climate of safety for all members of the College community. When you see the Safe Zone symbol, you will find an individual who is empathetic and informed about lesbian, gay, bisexual, transgender, queer and questioning, intersex, and asexual (LGBTQIA+) issues and who is willing and able to provide support and information. Campus Visitors While on any A-B Tech campus or site, all visitors and salespersons must abide by the following: a. When possible, instructors need to be informed of impending visitors and tours so that they can make appropriate preparations. Every effort will be made not to disrupt any class - room, lab or clinical activity. b. Solicitation for commercial purposes that is not a necessary part of the College’s opera - tions, activities or functions is restricted to time, place and manner as approved by the Vice President for Business & Finance/CFO or designee. If approved, sales calls must not disrupt the College’s normal operating and learning environment. Standard fees for the use of rooms, buildings or grounds may apply. (See Policy 318, Use of Facilities) c. Visitors and salespersons are not permitted in shops, laboratories or any other potentially hazardous areas at any time unless they are escorted by a College employee. d. Visitors and salespersons must comply with all College rules and regulations while on campus. e. Individuals, who are not conducting business or purposely engaged in a sanctioned activity of A-B Tech, may be asked to leave the College premises. All children on campus who are under the age of sixteen (16) must abide by the following: a. Must be a registered student or formally invited to attend a College-sponsored activity. Campus tours and student groups visiting the College are exempt from this procedure as long as the group is supervised by designated adults and a College representative. 2025-2026 Student Handbook and Calendar • 12 b. In some instances, children may accompany a parent or guardian to conduct College Business. These children must be under the direct supervision of the parent or guardian at all times. Note: Children are not allowed to accompany a parent or guardian to classes. Dress and Personal Appearance All students are expected to dress in a manner that is modest, clean and appropriate for the program of study. Good personal hygiene and grooming are also expected and may be outlined by the program of study. Shirts and shoes are required at all times.",
    "estimatedTokens": 761
  },
  {
    "pageNumber": 16,
    "text": "of the parent or guardian at all times. Note: Children are not allowed to accompany a parent or guardian to classes. Dress and Personal Appearance All students are expected to dress in a manner that is modest, clean and appropriate for the program of study. Good personal hygiene and grooming are also expected and may be outlined by the program of study. Shirts and shoes are required at all times. Vaping, E-cigarettes, and Tobacco Free Campus It is the policy of the Board of Trustees that Asheville-Buncombe Technical Community College provide students and employees with a safe and healthy environment. No form of tobacco, e-cigarette, or vaporizing device usage is permitted on A-B Tech’s campuses, sites or at College-affiliated activities and events. Financial Aid It is strongly recommended that all students apply for the full range of financial assistance. Approximately 70% of all students receive some form of financial aid assistance. Financial aid is awarded to fully accepted curriculum students working toward a certificate, diploma or degree. Please remember that not all certificate and diploma programs are eligible to receive federal and state aid. There are several types of aid available to students who demonstrate financial need and who maintain satisfactory academic progress. Please see below about the satisfactory academic progress standards for financial aid recipients. Students desiring financial aid for an academic year are encouraged to apply early (Prior to March 1) to ensure that their Free Application for Federal Student Aid (FAFSA) is processed prior to the first day of classes. To complete the FAFSA students must go to www.studentaid.gov . A student’s financial aid may be awarded as scholarships, grants, loans or work-study. The Financial Aid Office will award what a student is eligible for based on the information provided on their FAFSA. All correspondence from the Financial Aid Office is sent to students via their A-B Tech student email account. All students who apply to the College are automatically assigned a student email account. Information regarding how to access student email can be found on the A-B Tech website at abtech.edu/technology-support/student-emai l. Students should check their student email and Self-Service accounts regularly for information regarding their financial aid status, class information, registration, billing status, etc. After financial aid is awarded, students will receive an email instructing them to review their offer letter in Self-Service. The offer letter will display the amount and types of financial aid the student will receive. In some cases, students may be asked to accept or decline the aid they have been awarded. Students can access their Self-Service account from the A-B Tech website at abtech.edu. Students who are aware of any issues which may impact their ability to be academically successful are encouraged to contact the Financial Aid Office immediately for assistance. The Financial Aid Office is located in the K. Ray Bailey Student Services Center. Office hours are: Mon-Thurs: 8:30 a.m. – 5:00 p.m., Fri: 8:30 a.m. – 2:00 p.m. 13 • 2025-2026 Student Handbook and Calendar Bank.",
    "estimatedTokens": 800
  },
  {
    "pageNumber": 16,
    "text": "abtech.edu. Students who are aware of any issues which may impact their ability to be academically successful are encouraged to contact the Financial Aid Office immediately for assistance. The Financial Aid Office is located in the K. Ray Bailey Student Services Center. Office hours are: Mon-Thurs: 8:30 a.m. – 5:00 p.m., Fri: 8:30 a.m. – 2:00 p.m. 13 • 2025-2026 Student Handbook and Calendar Bank. Mobile for Financial Aid and Tuition Refunds A-B Tech has partnered with Bank. Mobile Disbursements, a financial services company, for the disbursement of student refunds.This partnership allows the College to expedite financial aid disbursements and student refunds by using direct deposit to distribute refunds. This means money will be available much more quickly than with traditional paper checks. Check out abtech.edu to learn more. For questions, call 398-7900. Auditing Courses Any individual may audit a College curriculum (for credit) class based on the following: • The individual pays the normal tuition and fees. However, any person who is at least 65 years old may audit courses without the payment of tuition provided the individual meets the other criteria listed herein. Individuals 65 years or older are still required to pay any local fees associated with audited courses. • Auditing students do not take tests or examinations and do not receive grades, credit or financial aid. Audits appear on a student’s transcript as a “Y” grade, which does not impact the student’s GPA. • Students auditing a course must meet the same course prerequisite and attendance standards as all other students in the course. Auditing a course will not meet the prerequisite of any sequential or higher-level course and cannot be used toward any certificate, diploma, or degree requirements. Physical Education classes may not be audited. • Auditing is subject to open seats in the course. A student who audits a course shall not displace other students seeking to enroll in the course. • Students who audit a course and withdraw will be issued a grade of “W”. Audited courses that are dropped prior to the 10% point of the course will not receive a grade nor appear on the student’s transcript. • Students choosing to audit a course must submit a Request for an Audit Grade form to the Records and Registration Office within the first 15 weekdays of the term for a 16-week class or an equivalent percentage for courses taught on a minimester schedule. The instructor must sign the form to approve the change to audit status. Students seeking to change from audit to credit status must contact the Records and Registration Office during the first five weekdays of the term for a 16-week class or an equivalent Satisfactory Academic Progress Standards for Financial Aid: The Higher Education Act of 1965, as amended by Congress in 1980, mandates institutions of higher education to establish minimum standards of “satisfactory progress” for students receiving financial aid.",
    "estimatedTokens": 744
  },
  {
    "pageNumber": 17,
    "text": "status must contact the Records and Registration Office during the first five weekdays of the term for a 16-week class or an equivalent Satisfactory Academic Progress Standards for Financial Aid: The Higher Education Act of 1965, as amended by Congress in 1980, mandates institutions of higher education to establish minimum standards of “satisfactory progress” for students receiving financial aid. For the purpose of maintaining a consistent policy for all students receiving financial aid administered by the College’s Financial Aid Office, these standards are applicable to all financial aid programs including federally sponsored Title IV programs. Satisfactory Progress Defined: A student is considered to be making satisfactory progress toward his or her curriculum program of study when three requirements are satisfied: 1. Maintain a minimum cumulative grade point average of 2.0. 2. Maintain a minimum cumulative completion rate of 50% if student has completed less than 30 credits. 2025-2026 Student Handbook and Calendar • 14 percentage for courses taught on a minimester schedule. Approval for changes from audit to credit status will be determined by the Registrar on a case-by-case basis. • Students 65 years or older who are seeking to have the tuition waived for an audited course must request the tuition waiver to the Records and Registration Office at the time when the Request for an Audit Grade form is submitted. • Current high school students, enrolled through the Career and College Promise program, may not audit classes that are tuition waived. Schedule Adjustments Dropping, withdrawing, or adding classes can change your enrollment status. Please check with the Financial Aid Office if you make schedule adjustments to see how your financial aid could be impacted. Adding a Class A student may add a class to their schedule in Self-Service or by visiting any Info Desk (K. Ray Bailey Student Services Center or A-B Tech Madison Office). For classes 14 weeks or longer, students may add the class up to 48 hours after the start of the first class meeting. For fully online classes that are 14 weeks or longer, students may add the class up to 48 hours after the class’s start date. For classes shorter than 14 weeks, students may add the class until the class meets for the first time. For fully online classes that are shorter than 14 weeks, students may add the class through the end of the start date for the class. Dropping a Class In order to officially drop from a course without academic penalty, the student must follow official College drop procedures by the drop deadline for the class. The student may drop classes through the first 10% point of each class. Specific dates can be provided by the Student Records and Registration Office. A class may be dropped in one of the following ways: 1. Students may drop a course through Self-Service. Distance students may receive assistance from the Distance Advisor. 2. By visiting any Info Desk (K. Ray Bailey Student Services Center or A-B Tech Madison Office). 3. By having the program advisor or Academic Advisor process the drop.",
    "estimatedTokens": 780
  },
  {
    "pageNumber": 18,
    "text": "be provided by the Student Records and Registration Office. A class may be dropped in one of the following ways: 1. Students may drop a course through Self-Service. Distance students may receive assistance from the Distance Advisor. 2. By visiting any Info Desk (K. Ray Bailey Student Services Center or A-B Tech Madison Office). 3. By having the program advisor or Academic Advisor process the drop. Students are responsible for ensuring drops have been processed by the appropriate deadline. In the case of drops, the course(s) will not be included on the transcript. Withdrawing from a Class After the 10% point of the term, a student wishing to withdraw from a class must complete an official Class Withdrawal Form. All withdrawal forms must be received by the K. Ray Bai - ley Student Services Center or Madison Site Office during the first 75% of the term. Students may email withdrawal forms to registrar@abtech.edu . In the case of a class withdrawal, the student will receive a grade of “W,” which will not influence the quality point ratio, but will appear on the transcript and may impact financial aid eligibility. Exceptions such as serious illness or job transfer requiring withdrawal from all classes after the 75% point of the term will be considered on an individual basis by the Vice President for. 15 • 2025-2026 Student Handbook and Calendar Student Services or his or her designee. A student who has withdrawn from a class may no longer attend the class. Tuition Refund Policy A 100% refund shall be made if a student drops the class(es) in Self-Service or by visiting Student Services in the Bailey Building prior to the start-date of the class that is published on the student’s schedule in Self-Service. A student is eligible for a 100% refund if the class in which the student is registered is canceled. A 75% refund shall be made if the student officially drops the class(es) prior to or on the official 10% point of the term. Insurance, technology, student activity, and curriculum matricu - lation fees are not refundable. Students registered for more than 16 credit hours are not charged additional tuition for those credits. Therefore, only hours dropped below a total of 16 credit hours are eligible for a refund. Tuition Refund Process To be eligible for a tuition refund the student must: 1. Register and pay tuition and fees. 2. Officially drop the class on or before the 10% point of the term in one of the following ways: a. By dropping the class online in Self-Service. b. By having a Student Service Staff person process the drop. The student is responsible for ensuring this has been done by the appropriate deadline. Class Attendance Regular and punctual class attendance is important in order to achieve success in the course and develop desirable personal traits necessary for success in employment. Instructors are responsible for establishing any attendance/participation requirements and for informing students of those requirements in the course syllabus at the beginning of the academic term. Students are responsible for fulfilling the requirements of the course that are outlined in the course syllabus.",
    "estimatedTokens": 788
  },
  {
    "pageNumber": 19,
    "text": "in the course and develop desirable personal traits necessary for success in employment. Instructors are responsible for establishing any attendance/participation requirements and for informing students of those requirements in the course syllabus at the beginning of the academic term. Students are responsible for fulfilling the requirements of the course that are outlined in the course syllabus. Students are allowed two days of excused absences each academic year for religious observances as required by law. Students must notify instructors in writing of expected religious absences. Course Entry Attendance Requirements It is mandatory that the student attend each course at least once during the first 10% of the course, or in the case of online courses, a graded activity must be submitted during the first 10% of the course. Each online course syllabus must identify the activity to be completed prior to the 10% point of the course, and the date by which the activity must be completed. For hybrid courses, the student must attend the classroom portion of the course or complete an online graded activity prior to the 10% point. Failure to attend or complete the activity prior to the 10% point will result in the student being dropped from the course. The student will not be allowed to continue in the course or receive a refund. 2025-2026 Student Handbook and Calendar • 16 Programmatic Attendance Requirements Some programs may have outside regulatory bodies that require a minimum of course atten - dance/participation hours. These requirements are clearly defined in the respective course syllabus or program orientation information. Federal regulations require that attendance be reported for students receiving certain types of veteran’s benefits and for certain classifications of international students. Instructors will be regularly asked to verify attendance for these specific student groups. Absences Due to Military Duty Students must provide prior official notification to instructors of military leave of absence(s). Responsibility for initiating such notice rests with the student. A-B Tech will give excused absences to students who are in the United States Armed Forces and who have received tem - porary or permanent reassignment as a result of military operations, as well as to students who are National Guard service members placed onto State active-duty status during an academic semester for which the student is enrolled. This includes: • Providing the student with the option, when feasible, to continue classes and course - work during the academic term through online participation for the period of time the student is placed on active duty; feasibility will be determined by the instructor and/or academic department. • Providing the student with the option of receiving a temporary Incomplete (“I”) grade for any course that the student was unable to complete as a result of being placed on State active duty status; however, the student must complete the course requirements within the first six weeks of the following semester or by an alternate date approved by the Vice President of Instructional Services.",
    "estimatedTokens": 789
  },
  {
    "pageNumber": 20,
    "text": "tment. • Providing the student with the option of receiving a temporary Incomplete (“I”) grade for any course that the student was unable to complete as a result of being placed on State active duty status; however, the student must complete the course requirements within the first six weeks of the following semester or by an alternate date approved by the Vice President of Instructional Services. • Permitting the student to drop, with no penalty, any course that the student was unable to complete as a result of being placed on State active-duty status. This includes receiv - ing a 100% refund for any tuition and fees for which the student directly paid. Absences Due to Religious Observance In compliance with state and federal laws, A-B Tech students are eligible for reasonable accommodations, including two excused absences each academic year, for religious practices or beliefs that are required by the student’s faith. The student must submit the Request for Accommodation for Religious Observance form to the instructor no later than the census date (10% point) for the class. Excused absences from classes for religious observances do not relieve students from responsibility for any part of the coursework required during the period of absence. Closings, Delays and Dismissals for Inclement Weather or Emergency Situations The College will close when weather conditions are such that travel is hazardous or an emergency or other situation occurs that would severely disrupt College operations or pose a threat to employees, students, and/or visitors. 1. The President shall determine the classifications of days as hazardous, marginal or late opening. 2. Announcements concerning the A-B Tech operating schedule will be made as soon as possible and announced via multiple methods, including the following:. 17 • 2025-2026 Student Handbook and Calendar • Text alerts (for which all students and employees may register through Self-Service under Update Contact Information), • Employee and student email, the College website ( abtech.edu ), • The College’s main telephone number (828-398-7900), • The College’s Facebook and Instagram accounts, and • Through local radio and TV stations announcements. If it appears that the inclement weather conditions will be cleared before the day is over or the emergency/other situation has been addressed, a late opening will be announced as soon as possible. Students should attend classes according to the announcement. 3. For classes at A-B Tech Madison and A-B Tech Woodfin, the Director of each campus will make a weather-related announcement as soon as possible regarding closing via direct communication, the local campus telephone message or the campus Facebook page. If it appears that the inclement weather conditions will be cleared before the day is over or the emergency situation has been addressed, a late opening will be announced as soon as possible. Students should attend classes as scheduled. 4. If conditions become worse after an initial decision for delayed opening is made, an addi - tional announcement closing the College for the day and/or evening will be made as soon as possible. 5.",
    "estimatedTokens": 792
  },
  {
    "pageNumber": 21,
    "text": "ather conditions will be cleared before the day is over or the emergency situation has been addressed, a late opening will be announced as soon as possible. Students should attend classes as scheduled. 4. If conditions become worse after an initial decision for delayed opening is made, an addi - tional announcement closing the College for the day and/or evening will be made as soon as possible. 5. Closing or delaying the College for the day does not automatically close it for the evening. Decisions will be made concerning evening programs and services in the afternoon and announced by 2 p.m. whenever possible. Faculty, staff, and students should continue to check for these announcements. 6. When weather conditions or emergency situations dictate early dismissal of day or eve - ning classes, the announcement will be made by all means possible. 7. Curriculum and Continuing Education class work and sessions may be made up by resched - uling the class, extra assignments, individual conferences, extended class sessions, on-line assignments, or other alternatives as determined by the applicable senior administrator. 8. Important reminder: In the event of inclement weather or other emergency situations, commuters (particularly those from outlying or remote areas) should exercise personal judgment concerning road or other conditions, regardless of College announcements. The College values the safety of our students, faculty and staff and does not expect anyone to take unnecessary risk while attempting to report to work or class. Student Life and Development A-B Tech’s Department of Student Life and Development works to create a dynamic, inclusive and collaborative college environment. The department provides opportunities for personal and professional enrichment, leadership development, civic engagement, as well as support - ing co-curricular education. Student Life Development offers events and programming that provide enriching experiences for students. The Student Life offices are located in the Coman Student Center and can be reached at 398-7594 or 398-7203 or studentlife@abtech.edu . Student Government Association Get involved in the Student Government Association (SGA). Meetings are open to all enrolled curriculum students. The SGA is committed to informing, guiding, serving and advocating for students, while offering opportunities for leadership development, and personal growth. Operating under the supervision of the Student Life and Development department, the SGA. 2025-2026 Student Handbook and Calendar • 18 serves as the voice of students to the College administration. Meetings are held biweekly on Wednesdays at 4:00 p.m. in Ferguson 117. Stay up to date with events in Trailblazer Talk. The SGA Office is located in the Coman Student Center and can be reached at sga@abtech.edu or 398-7205. The Student’s Role in Institutional Decision Making A-B Tech encourages student participation in the institution’s decision-making process. Toward this end, student representatives are included as members on various standing committees across the college. Additionally, the Student Government Association President serves on the A-B Tech Board of Trustees.",
    "estimatedTokens": 800
  },
  {
    "pageNumber": 22,
    "text": "n be reached at sga@abtech.edu or 398-7205. The Student’s Role in Institutional Decision Making A-B Tech encourages student participation in the institution’s decision-making process. Toward this end, student representatives are included as members on various standing committees across the college. Additionally, the Student Government Association President serves on the A-B Tech Board of Trustees. Student Activity Fee Usage The Student Life and Development department and Student Government Association enrich the student experience with a wide range of personal and professional development resourc - es designed specifically for college students. All student activities are financed through the activity fee paid by curriculum students. Here are just a few of the resources, services, and activities provided: Campus Festivals, Events and Activities, Academic Achievement Ceremonies, Student Clubs, Co-Curricular Outings, Health & Wellness Fair, Student Handbook, Student Government Association Services, Discounted Asheville Transit Passes, Student Health Clinic Vouchers, Student Dental Clinic Vouchers. Student Intramurals A-B Tech offers a wide variety of intramural activities that are open for student and employee participation. Stop by the gymnasium in the Coman Student Center to sign up. For more details, contact Rhonda Davidson at rhondaldavidson@abtech.edu . Forming Clubs and Societies A-B Tech hosts 15-18 chartered clubs and societies each academic year. Students wishing to form a new society on campus must seek official recognition through the Student Government Association. A chartering form must be submitted along with a copy of the proposed organiza - tion’s constitution and bylaws. Upon approval by the SGA Senate, the constitution and bylaws shall be forwarded to the Student Life and Development office for final approval. For a Club and Society handbook, contact the Student Government Association at sga@abtech.edu or 398-7205. The SGA Office is located in the Coman Student Center. For more information, visit abtech.edu/sga . 19 • 2025-2026 Student Handbook and Calendar Student Clubs and Societies A-B Tech sanctioned clubs, societies, and leadership programs are designed to enhance the college experience for curriculum students. Below is a list of student organizations along with advisor contact information. For more detailed information, please contact the Student Government Association at sga@abtech.edu . (This list is subject to change). • School of Nursing Club: Denice Morgan - denicermorgan@abtech.edu The School of Nursing Club is open to students in the ADN and Practical Nursing programs. The purpose of this club is to assume responsibility for contributing to nursing education and influence the educational process. The club provides programs that are representative of fundamental and current professional interests and concerns. This club aids in the development of the whole person, his or her professional role, and his or her responsibility for the health care of people of all walks of life.",
    "estimatedTokens": 764
  },
  {
    "pageNumber": 23,
    "text": "of this club is to assume responsibility for contributing to nursing education and influence the educational process. The club provides programs that are representative of fundamental and current professional interests and concerns. This club aids in the development of the whole person, his or her professional role, and his or her responsibility for the health care of people of all walks of life. • Cardiovascular Sonography: Kelli Harrell - Kellinharrell@abtech.edu The promotion of scholarship, development of leadership & service, and cultivation of fellowship among qualified cardiovascular sonography students. • Dental Assisting Club: Tisha Anderson – tanderson@abtech.edu The Dental Assisting Club cultivates, promotes and sustains the art and science of the dental assisting field. Open to current, full-time Dental Assisting students, the club represents and safeguards the common interest of its members and contributes to the improvement of public health. • Art Society: William Derek Rhodarmer- williamdrhodarmer@abtech.edu A space for students who enjoy creating art to meet up to connect as artists, and go on art-focused field trips. • Medical Assisting Club: Candace Crump - candacescrump@abtech.edu The Medical Assisting Student Association (MASA) promotes the exchange of ideas, experience and fellowship among Medical Assisting students and educators at A-B Tech. Members are encouraged in scholarship, leadership, and service. Through club membership, students are provided the opportunity to join the American Association of Medical Assistants. • National Society of Leadership and Success: NSLS Advisors- NSLS@abtech.edu This leadership development program is open to curriculum students who have com - pleted at least 12 credit hours in good standing with a 3.0 GPA. The National Society of Leadership and Success chapter is a leadership program that has hundreds of branches throughout the nation at community colleges and universities. Membership invitations are issued twice a year. • Nuestra Voz: Alikhan Salehi - alikhanhsalehi@abtech.edu A space to build community and connection for those who are part of the Latin. X commu - nity, or interested in Latin. X heritage, culture, and language. • Queer the Way: Porscha Orndorf - porscharorndorf@abtech.edu or Dean Paulk – deanspaulk@abtech.edu Queer the Way was formed to develop community among A-B Tech students to provide a positive atmosphere and influence for LGBTQIA+ students and their allies. The club encourages networking, education and awareness to promote healthy relationships and general wellbeing. 2025-2026 Student Handbook and Calendar • 20 • Radiology Club: Sereitha Miller - sereithadmiller@abtech.edu The purpose of this club is to provide incoming radiography program students with a base to develop a wider understanding of diagnostics radiography and coordinating modalities. This club encourages the discussion of thoughts, experiences and ideas for a radiography student in clinic and academic curriculum.",
    "estimatedTokens": 753
  },
  {
    "pageNumber": 24,
    "text": "Handbook and Calendar • 20 • Radiology Club: Sereitha Miller - sereithadmiller@abtech.edu The purpose of this club is to provide incoming radiography program students with a base to develop a wider understanding of diagnostics radiography and coordinating modalities. This club encourages the discussion of thoughts, experiences and ideas for a radiography student in clinic and academic curriculum. • Sonography Society: Chastity Case - chastitylcase@abtech.edu The purpose of the A-B Tech Sonography Society at the college shall be the promotion of scholarship, the development of leadership and service and the cultivation of fellowship among qualified Medical Sonography students. • Student Occupational Therapy Association (SOTA): Heather Hall – heatherphall@abtech.edu SOTA is an organization for OTA students. Through engagement of educational and social activities, OTA students have advocacy, service, and learning opportunities that assists in the development of a strong foundation with the occupational therapy profes - sion. This association fosters partnership, mentorship, and professionalism within the A-B Tech Occupational Therapy Assistant curriculum. • Student Paramedic Association: Madelyn Johnson - madelyndjohnson@abtech.edu The mission of the Association of Student Paramedics is to provide a unified voice in rep- resenting the members to institutes of learning, government agencies and other organizations. The Association of Student Paramedics provides a resource for the exchange of ideas and the advancement of the paramedic profession. • Surgical Technology Club: Rachel Vickers - rachelvickers@abtech.edu The purpose of the A-B Tech Surgical Technology Club is to promote the exchange of ideas and experiences of surgical technology as a profession. A variety of fundraising activities occur throughout the year in the curriculum to provide funds for professional organization membership and pinning ceremony. • Veterinary Technology Club: Sierra Allen - sierramallen@abtech.edu The club provides learning opportunities for Veterinary Technician students through field trips, guest speakers and community activities. It increases the profile of the A-B Tech Veterinary Medical Technology program and the community of veterinary medicine by participation and organizing career days, seminars and conferences. It raises awareness about issues pertaining to the health and well-being of companion animals and livestock by participating in campus and Student Government activities. For a complete listing of current clubs and societies, please visit abtech.edu/student-organizations . 21 • 2025-2026 Student Handbook and Calendar Entrepreneurial Resources for Students The A-B Tech Small Business Center (SBC) provides a variety of free services to both start-up and existing businesses and is a great resource for students. Located at A-B Tech Enka, the mission of the SBC is to offer high quality programming which is readily accessible; this is accomplished by providing a variety of free seminars on small business topics as well as free confidential business counseling.",
    "estimatedTokens": 776
  },
  {
    "pageNumber": 25,
    "text": "B Tech Small Business Center (SBC) provides a variety of free services to both start-up and existing businesses and is a great resource for students. Located at A-B Tech Enka, the mission of the SBC is to offer high quality programming which is readily accessible; this is accomplished by providing a variety of free seminars on small business topics as well as free confidential business counseling. SBC staff are also available to speak to classes, clubs and meet students at the Asheville campus. For more information, please contact Jill Sparks at jillmsparks@abtech.edu or 828-398-7949. Instagram: @abtechsmallbusinesscenter & @ncsbcn. Health Clinic for Students and Employees The clinic provides examinations by a medical doctor/physician assistant. Student fees are $20 per visit. Services include, but are not limited to, STI testing, bloodwork (for an additional cost), flu vaccines, TB testing, physicals (for an additional cost), COVID testing, treatment for aches, blood pressure evaluations, prescriptions, minor emergencies, medical questions, common cold, flu and virus care, and a food pantry. Student vouchers are available upon request. For more information and clinic hours call 828-398-7570 or email healthclinic@abtech.edu . The clinic is located in the Allied Health & Workforce Development building in room 115.17. Dental Services for Students A-B Tech Allied Dental Clinic offers great savings on dental treatment. The services provided are routine dental cleaning, periodontal (deep) cleaning, fluoride treatments and digital radiographs. The clinic is by appointment only and accepts cash, check and credit cards. For additional information, you may call 828-398-7255 or email us at dental@abtech.edu . Mountain Tech Spa Services Need a haircut facial, manicure, pedicure, or other spa services to relieve some school stress? The Mountain Tech Spa, an on-campus facility, offers low-cost services. For more information or to schedule an appointment, please email spa@abtech.edu or call 398-7670. Food Options on Campus Various food options exist at A-B Tech. For the Victoria Road campus, food trucks, Bridge & Tunnel Café located in the Coman Building, and the College Bookstore located in the Bailey building have all variety of options during the day. Vending machines provide a quick snack between classes. Picnic tables can be found across campus. Food trucks and vending machines exist at other A-B Tech campus locations as well. Visit the weekly updates page for dining options. Bridge & Tunnel Café Bridge & Tunnel Coffee Company provides a full coffee, espresso, tea, nitro cold brew and smootie bar, pastries, and healthy breakfast, and lunch options in the Coman Student Center. 2025-2026 Student Handbook and Calendar • 22 Student Food Pantry To remove one more barrier to obtaining educational goals, three campus food pantries of non-perishable items are available for students. 1. Bailey Student Service Center. Available Monday through Thursday from 8:30 a.m. - 5 p.m., Friday 8:30 a.m. - 2 p.m. To access, simply sign in at the First Stop for Support Services. 2. Hemlock building lobby Monday through Thursday 8:30 a.m. – 9 p.m. 3.",
    "estimatedTokens": 794
  },
  {
    "pageNumber": 26,
    "text": "antry To remove one more barrier to obtaining educational goals, three campus food pantries of non-perishable items are available for students. 1. Bailey Student Service Center. Available Monday through Thursday from 8:30 a.m. - 5 p.m., Friday 8:30 a.m. - 2 p.m. To access, simply sign in at the First Stop for Support Services. 2. Hemlock building lobby Monday through Thursday 8:30 a.m. – 9 p.m. 3. Ferguson Allied Health Workforce Development building in the Health Clinic in room 115.17. Available on Tuesdays from 8:30 a.m. - 12:30 p.m. The Health Clinic is also available during this time. To have access to the food pantry outside those hours, email candacescrump@abtech.edu Dining with the A-B Tech Culinary Arts Programs The Culinary Arts, Baking and Pastry Arts, and Hospitality Management students offer public dining for lunch and dinner on most Thursdays in the fall and spring semesters. If you would like to receive the schedule and menus, please email reservations@abtech.edu. More infor - mation can be found at abtech.edu/dining . Sustainability A-B Tech is committed to increasing sustainability practices on campus, this includes recycling and waste reduction, solar energy production, stormwater reduction, sustainability certificates and classes, education on bears and other campus wildlife, pollinator gardens, Treasured Trees, and more. To learn more about sustainability efforts at A-B Tech, please visit abtech.edu/green-abtech or email sustainability@abtech.edu . Don C. Locke Library Don C. Locke Library provides books. e-resources, and research databases to support student learning. We also offer DVDs, audiobooks, a North Carolina collection, and streaming video through Films on Demand and Docuseek. Research computers are available on the main level, and our librarians are happy to help with any research questions. Laptops, hotspots, and calculators can be checked out for in-library and home use. The Locke Library is also home to the Center for Academic Achievement. Open hours are Monday & Thursday, 8 a.m. - 7:00 p.m., Tuesday & Wednesday, 8 a.m. - 6 p.m., and Friday, 8 a.m. - 4:00 p.m. Hours may vary from semester to semester. Academic Resources and Advising The College has a sincere interest in helping all students attain their goals. Students who find they need or want additional help outside the classroom, or who feel they would benefit by and enjoy more active involvement with faculty and students seeking to build a welcoming, inclusive, integrative and sustaining academic community at A-B Tech, should explore the following sources of support: Instructors: Students are encouraged to stop by during office hours to seek assistance regarding course material. 23 • 2025-2026 Student Handbook and Calendar Center for Academic Achievement: The Center for Academic Achievement, located on the lower level of the Locke Library, provides students with many support services. The services include free drop-in tutoring for math (all levels) and sciences (chemistry, physics, biology, engineering) as well as Accounting and Spanish.",
    "estimatedTokens": 770
  },
  {
    "pageNumber": 27,
    "text": "istance regarding course material. 23 • 2025-2026 Student Handbook and Calendar Center for Academic Achievement: The Center for Academic Achievement, located on the lower level of the Locke Library, provides students with many support services. The services include free drop-in tutoring for math (all levels) and sciences (chemistry, physics, biology, engineering) as well as Accounting and Spanish. Tutoring appointments are available in the Writing Center to support students in their writing process across all disciplines and all stages of development. Writing Center appointments can also be made for academic coaching to support students in developing time management, organization, and foundational computer skills. All academic support services are available both in person and virtually. The Center for Academic Achievement aims to provide a safe, welcoming space for students to gain the skills, knowledge and confidence to be successful in their courses. Please visit the website for up-to-date information and hours related to tutoring services, abtech.edu/tutoring . Testing Center: The Testing Center has been established to facilitate placement testing, testing with accommodations, and testing for Selective Allied Health programs. For additional information, please contact the Testing Center staff at 398-7219. Student Advising: Advising provides comprehensive support for all curriculum students, including those pursuing transfer degrees, Applied Science programs, Selective and Limited programs, or enrolling as international or unclassified students. Advisors are located in the K. Ray Bailey Student Services building and are available to help students select appropriate pathways, plan first-semester classes, explore guaranteed admissions programs, and register for courses aligned with their academic goals. Advising is available on a walk-in basis or by virtual appointment: • Monday–Thursday: 9:00 a.m. – 5:00 p.m. • Friday: 9:00 a.m. – 2:00 p.m. Please note, extended hours may be available during peak times. Check the website for updated Hours of Operation . Walk-ins are always welcome, but appointments are encouraged during peak advising periods. Students can schedule a virtual advising appointment through the following link: Schedule an Appointment: virtual advising appointment . For general questions, contact us at: advising@abtech.edu . 2025-2026 Student Handbook and Calendar • 24 A-B Tech’s Quality Enhancement Plan: PEAK Performance - A-B Tech Success Coaching The PEAK Success Coaching program at A-B Tech is a college initiative aimed at empowering students for academic success and beyond. This program is A-B Tech’s 2024-2029 QEP (Quality Enhancement Plan). Students eligible for the Success Coaching program will be notified by email. Professional success coaches embedded within academic divisions provide personalized support, guidance, and resources to students.",
    "estimatedTokens": 729
  },
  {
    "pageNumber": 28,
    "text": "Success Coaching program at A-B Tech is a college initiative aimed at empowering students for academic success and beyond. This program is A-B Tech’s 2024-2029 QEP (Quality Enhancement Plan). Students eligible for the Success Coaching program will be notified by email. Professional success coaches embedded within academic divisions provide personalized support, guidance, and resources to students. Coaches work with students from pre-enrollment to graduation, assisting with goal setting, engagement, connecting to resources, and career guidance, facilitating the acquisition of institutional and life-skills knowledge required to establish resiliency and empowerment to achieve long and short-term goals. The PEAK Success Coaching Program focuses on enhancing students’ academic performance, confidence, and skills through a collaborative relationship between students and coaches. Through the program, students will experience increased satisfaction with the college and their educational experience, success rates, retention, and credential completion, along with decreased equity gaps in academic performance and graduation rates. This initiative aligns with the strategic goals of RISE Above and foundational focus areas such as learner focus, barrier removal, and equity. Services for Distance Learners Prior to registering for a fully online curriculum course, students should visit the Distance Learning at A-B Tech at abtech.edu/college-resources/onlinedistance-learning . Here students will find helpful links and resources for successful online learning including an online readi - ness self-assessment. Students are also encouraged to complete an optional Moodle Online Orientation found at moodle.abtech.edu/course/view.php?id=53843 . Following is the list of Student Services available to distance students. Most of these resources are available from the College website at abtech.edu : 1. Application: Application to the College may be made on the College website. 2. Student Orientation: The New Student Orientation is online. 3. Student Handbook: The Student Handbook is also available on the College website. 4. Transcript Evaluation: Transcripts from colleges previously attended may be mailed or sent electronically to A-B Tech by the originating college and can be evaluated for - transfer credit, if transfer credit is desired. Students will receive a summary of transfer credits in Self-Service. 5. Application for Program Completion: The application is available on the College website at abtech.edu/records-and-registration-overview . Applicants will receive an email response to their A-B Tech email account. 6. Catalog: The catalog is available on the College website. 7. A-B Tech Transcripts: Transcript requests may be made online at abtech.edu/transcripts . 8. Adding/Dropping/Withdrawing from Classes: Distance learners may add or drop classes online via Self-Service. Distance learners may receive assistance with withdrawing from classes by emailing the Registrar’s office at registar@abtech.edu . 9. Schedule of Classes: Curriculum schedules are available in Self-Service. 25 • 2025-2026 Student Handbook and Calendar 10.",
    "estimatedTokens": 790
  },
  {
    "pageNumber": 28,
    "text": "line at abtech.edu/transcripts . 8. Adding/Dropping/Withdrawing from Classes: Distance learners may add or drop classes online via Self-Service. Distance learners may receive assistance with withdrawing from classes by emailing the Registrar’s office at registar@abtech.edu . 9. Schedule of Classes: Curriculum schedules are available in Self-Service. 25 • 2025-2026 Student Handbook and Calendar 10. Financial Aid: Applications for federal financial aid (FAFSA) are available at www.studentaid.gov and scholarship applications are available on the College website. Financial Aid information is available by emailing financialaidoffice@abtech.edu or calling 828-398-7900. 11. Academic Advising: Advising provides comprehensive support for all curriculum stu - dents, including those pursuing transfer degrees, Applied Science programs, Selective and Limited programs, or enrolling as international or unclassified students. Students can schedule a virtual advising appointment through the following link: Schedule an Appointment . For general questions, contact us at: advising@abtech.edu . 12. Veterans’ Services: Veterans’ services and advice are available by emailing the Veter - ans’ Coordinator at veteranservices@abtech.edu . 13. Disability Services: Students with disabilities as defined by the Americans with Disabilities Act may seek services by completing the request forms at abtech.edu/supportservices . 14. Career Services: For those who need assistance in choosing a major/program, re - searching specifics of various occupations, writing resumes, and/or interviewing skills, counselors are available by appointment. Students may schedule an appointment by using links on abtech.edu/careers . 15. Personal Counseling: Available for enrolled students virtually. Contact supportservices@abtech.edu to schedule an appointment. 16. Placement Assessment: Placement assessment may be accomplished at any college which offers the approved placement tests. Scores can then be faxed by or emailed the originating college. For information, contact the Testing Center at testingcenter@abtech.edu . Students may schedule a placement test or view approved tests at abtech.edu/placement . 17. Payment of Tuition and Fees: Tuition and fees may be paid online from the College website or by using Self-Service. 18. Purchase of Books: Books may be purchased online from the College Bookstore. 19. Online Technical Assistance: The College provides a Help Desk for students who experience technical issues with Moodle, Self-Service and other college online services. Students may contact the Help. Desk at helpdesk@abtech.edu or at 828-398-7550. 20. Library Services: Students may access the resources of the Locke Library by visiting abtech.edu/library . 21. Academic Assistance: The Center for Academic Achievement offers Tutoring services for distance learners. For more information, visit abtech.edu/ tutoring . 22. College Events: An updated list of college-sponsored activities and events is available on the College’s website calendar. 23.",
    "estimatedTokens": 761
  },
  {
    "pageNumber": 29,
    "text": "20. Library Services: Students may access the resources of the Locke Library by visiting abtech.edu/library . 21. Academic Assistance: The Center for Academic Achievement offers Tutoring services for distance learners. For more information, visit abtech.edu/ tutoring . 22. College Events: An updated list of college-sponsored activities and events is available on the College’s website calendar. 23. Information about computer set-up: The College provides information on the proper technical setup that will be needed for a student to fully engage in the online learning process. This information is located at abtech.edu/content/distance-learning/set - ting-your-computer . 24. Moodle Orientation: A self-paced Moodle Online Orientation is available to students. This course provides students with the opportunity to test drive the features of Moodle and solicit feedback from an online instructor prior to the start of their curriculum class(es). Completion of the Moodle Online Orientation is required prior to enrollment in fully online curriculum classes. 2025-2026 Student Handbook and Calendar • 26 25. Proctored Exams and Identity Verification Costs: A-B Tech does not currently charge online students a separate fee for identity verifi - cation. Students enrolled in distance education/online courses at A-B Tech may be required to take proctored exams (exams administered by an approved testing facility). Each distance education/online course will indicate requirements for proctored exams prior to registration. A-B Tech students may take all proctored exams in the Proctoring Center at no charge. Students may also use any A-B Tech approved proctoring location; however, it is the student’s responsibility to locate and seek approval of the site. In ad - dition, students using a site other than the A-B Tech Proctoring Center may be subject to fees charged by the respective location. Information on A-B Tech’s Testing Procedures, including required forms, may be found at abtech.edu/college-resources/testing-center/ campus-testing-procedures . Academic Procedures Classification of Students Full-time student: A student enrolled for 12 or more credit hours during fall and spring semes - ter, and 9 or more credit hours during the summer session. Part-time student: A student enrolled for fewer than 12 hours during fall or spring semesters or fewer than 9 credit hours during summer session. (Please note that financial aid recipients registered during the summer will need 12 credit hours for full Pell awards.) Declaring, Changing, or Adding Second Majors In order to declare a program of study, change programs, or add a second program of study, students are encouraged to use “Change My Academic Program” in Web. Advisor or meet with a Student Advisor in the K. Ray Bailey Student Services Center. The catalog in effect for the term in which the student will begin the program of study will be the catalog recorded for the selected program. If a student is unable to use the “Change My Academic Program” feature, the student should contact an advisor in the K. Ray Bailey Student Services Center or send an email to advising@abtech.edu for more information.",
    "estimatedTokens": 795
  },
  {
    "pageNumber": 30,
    "text": "e K. Ray Bailey Student Services Center. The catalog in effect for the term in which the student will begin the program of study will be the catalog recorded for the selected program. If a student is unable to use the “Change My Academic Program” feature, the student should contact an advisor in the K. Ray Bailey Student Services Center or send an email to advising@abtech.edu for more information. Prerequisites and Corequisites Before enrolling in a course with prerequisite requirements, students must satisfactorily com - plete the prerequisite course(s). Corequisite courses must be taken prior to or during the same term. Exceptions may be approved by the appropriate department chairperson, dean, and/or vice president and will be documented in the student’s academic file. Course Substitutions Curriculum course substitutions must be approved by the Dean responsible for the course being substituted. Some course substitutions also require Vice President of Instructional Services approval. Approved course substitutions are forwarded to registrar@abtech.edu . 27 • 2025-2026 Student Handbook and Calendar Introduction to College Courses for Diploma or Degree-Seeking Students Degree-seeking students who enroll in a college program requiring ACA 115, ACA 122, EGR 110 or any equivalent course, must enroll in and successfully complete the course with a grade of “C” or better in their first semester of enrollment. Students who do not meet this requirement will be prevented from registering for future semesters without enrolling in the course. Any student who places into more than one developmental course must enroll concurrently in ACA 115, ACA 122 or EGR 110 as appropriate for his or her curriculum. Students will be permitted to substitute another course for ACA 115 or EGR 110 and will not be subject to the above requirement and subsequent restrictions if they either transfer in a similar course, transfer in 24 or more transfer credit hours of college-level work, or have a conferred associate degree, or higher degree. Work-Based Learning In selected programs, A-B Tech provides students with an opportunity to integrate classroom learning with supervised work experience in an employment situation directly related to the educational program of the student. The work experience component is an integral part of the total educational process. The primary objective of work-based learning is to prepare the student for employment. To be eligible to participate in a work-based learning, a student must be 18 years of age, be enrolled in a curriculum program that provides a work-based learning option, have a minimum 2.0 cumulative program GPA, have completed required course prerequisites, and have completed a minimum of 9 semester credit hours within the appropriate program of study. Approval by the department chairperson is required for a student to participate in a work-based learning activity. Any exceptions to these requirements must be approved by the appropriate academic dean. Independent Study Selected courses may be available for independent study, with approval of the appropriate dean.",
    "estimatedTokens": 782
  },
  {
    "pageNumber": 31,
    "text": "leted a minimum of 9 semester credit hours within the appropriate program of study. Approval by the department chairperson is required for a student to participate in a work-based learning activity. Any exceptions to these requirements must be approved by the appropriate academic dean. Independent Study Selected courses may be available for independent study, with approval of the appropriate dean. A student requesting to take a course by independent study must complete the Request for Independent Study form and have it approved by the department chair and division dean prior to registration. The request to enroll in a course by independent study may be approved when the following conditions are met: • The course is not offered during the current semester or is in schedule conflict with an - other required course and is needed for the student to qualify for graduation or transfer. • The student has a cumulative grade point average of 2.0 or higher. • The student has completed 15 semester hours of study in his or her academic program at A-B Tech. • A full-time faculty member, with the approval of the department chair, agrees to serve as the instructor for the semester of independent study. • Any exceptions must be justified by special circumstances and approved by the Vice President for Instructional Services. 2025-2026 Student Handbook and Calendar • 28 Maximum Course Load Because of the amount of effort that is expected to be put forth in college-level courses, students are limited to a maximum of 20 hours of course work each semester. Exceptions to this rule may be granted by the Vice President for Instructional Services. Academic Honors and Achievements Dean’s List For the Dean’s List, students must be enrolled in an academic program (degree, diploma or certificate), carrying a minimum of eight credit hours of curriculum courses numbered 100 or above. Students must have a minimum 3.75 quality point average to qualify for the Dean’s List for the semester under consideration. Students who earn grades of F or I are not eligible for the Dean’s List for that semester. Students receiving credit for a course by examination are not affected. Only courses numbered 100 and above will be considered. The Dean’s List will be compiled by the Registrar. President’s List For the President’s List, students must be enrolled in an academic program (degree, diploma or certificate), carrying a minimum of twelve credit hours of curriculum courses numbered 100 or above. Students must have a 4.0 quality point average to qualify for the President’s List during the semester under consideration. Only courses numbered 100 and above will be considered. Students who earn grades F or I are not eligible for the President’s List for that se - mester. Students receiving credit for a course by examination are not affected. The President’s List will be compiled by the Registrar. The Vice President for Student Services will notify Dean’s and President’s List recipients of their academic achievement. Recipients will be invited to participate in the Academic Achievement Ceremonies held during the spring and summer each year.",
    "estimatedTokens": 787
  },
  {
    "pageNumber": 32,
    "text": "st for that se - mester. Students receiving credit for a course by examination are not affected. The President’s List will be compiled by the Registrar. The Vice President for Student Services will notify Dean’s and President’s List recipients of their academic achievement. Recipients will be invited to participate in the Academic Achievement Ceremonies held during the spring and summer each year. Phi Theta Kappa Academic Honors The College recognizes students who have achieved a GPA of 3.5 after 12 credits of com - pleted work (100 level courses and above) by providing students with an opportunity to join the national Phi Theta Kappa Academic Honor Society. Membership is an individual decision that provides students with access to national resources and services including scholarship opportunities. Members may wear regalia items at the A-B Tech Commencement ceremony. Invitations are issued annually to eligible students. Transfer Credit (Transcript Evaluation) Asheville-Buncombe Technical Community College will accept credit transfer from institu - tions recognized by a regional accrediting agency. A-B Tech will also consider transfer credit from non-regionally accredited institutions of higher education for only career and technical courses if the institution is accredited by an organization recognized by the Council for Higher Education Accreditation. Transfer applicants should complete the standard College applica - tion. No credit will be granted for work below a “C.” Information Technology courses must be less than 5 years old for transfer credit to be awarded. Transfer credit will be awarded for course work without assigning grades or quality points. Proficiency credits from other institutions will not be accepted. No more than 75% of the credit hours required in a program may be earned by transfer credit. If any course is taken for credit after transfer credit has been awarded, and a grade of A, B, C, D or F is earned, it will replace the transfer credit in cumulative GPA calculation. A student who must repeat a. 29 • 2025-2026 Student Handbook and Calendar Credit by Examination Students who can provide tangible evidence of preparation to challenge a course, such as a transcript of similar college-level credits, record of military study, certification or license, standardized test scores, or written statements from employers regarding training or directly related work experience indicating they may be proficient in a subject, may request credit by examination. A written request must be made to the proper department chairperson on a form obtained from the Student Records and Registration Office or from the website. This test must be administered immediately after the 10 percent point in the semester. course may take it at another institution and transfer it to A-B Tech according to the guide - lines above. Transfer credit may be awarded for appropriate military courses. Transfer credit may be awarded for courses completed at a foreign university; students should contact the International Student Advisor for more information. Credits will be evaluated in the context of the current catalog.",
    "estimatedTokens": 788
  },
  {
    "pageNumber": 33,
    "text": "ter. course may take it at another institution and transfer it to A-B Tech according to the guide - lines above. Transfer credit may be awarded for appropriate military courses. Transfer credit may be awarded for courses completed at a foreign university; students should contact the International Student Advisor for more information. Credits will be evaluated in the context of the current catalog. Students transferring into the Associate in Arts (A.A.), Associate in Science (A.S.), Associate in Fine Arts (A.F.A.), or Associate in Engineering (A.E.) programs who have transfer credit from colleges other than the North Carolina Community College System (NCCCS) or the institutions in the University of North Carolina System should speak with their advisor regarding eligibility for the Articulation Agreement between the universities and NCCCS. Academic Fresh Start Any returning student who has not attended A-B Tech for three years and upon re-enrolling maintains a 2.0 GPA for a minimum of 12 semester hours may petition to have grades on all prior course work more than three years old with a grade less than a “C” excluded in calculating the cumulative GPA. Grades below “C” disregarded in calculating the GPA will not count toward graduation but will remain on the transcript. The student should complete an application for Academic Fresh Start, obtained in the Records and Registration Office, after the end of the semester in which he/she has completed the 12 semester hours required. A student who plans to transfer to another college should contact that institution to determine the impact of Academic Fresh Start on transfer. Please note that an Academic Fresh Start does not impact calculation of Satisfactory Academic Progress for financial aid purposes. Transcripts Transcripts are maintained by the Registrar’s Office and ordered through a third-party tran - script ordering system, with the exception of on-demand transcripts which are distributed directly by the Registrar’s Office. Students must provide written or electronic consent before a transcript may be released. Information about requesting transcripts is available on the College website at abtech.edu/transcripts. Transcript fees vary depending on delivery type: $5.00 Electronic Transcript (delivered by third party vendor) $7.50 Standard hard copy transcript (delivered by third party vendor) $33.00 Overnight Delivery (delivered by third party vendor) $10.00 On-demand transcript (A-B Tech walk-ins) Rates vary depending on location for International delivery (delivered by third party vendor). 2025-2026 Student Handbook and Calendar • 30 Examinations are comprehensive and must be approved by the supervisor of the instructor administering the exam. The examination may be oral, performance, written or a combination of these methods. To receive credit by examination, the score must be above average (“A” or “B”). A grade of “A” or “B” will be posted on the transcript of the student who successfully completes the examination. The decision of the examining instructor is final.",
    "estimatedTokens": 767
  },
  {
    "pageNumber": 33,
    "text": "e approved by the supervisor of the instructor administering the exam. The examination may be oral, performance, written or a combination of these methods. To receive credit by examination, the score must be above average (“A” or “B”). A grade of “A” or “B” will be posted on the transcript of the student who successfully completes the examination. The decision of the examining instructor is final. No student may request a second test for Credit by Examination in the same course or request Credit by Examination in a course after receiving any recorded grade for that course. Exceptions must have approval of the Vice President for Instructional Services. Because of specific requirements, credit for certain courses may not be received through Credit by Examination. Students who request Credit by Examination must: 1. Enroll as a credit student in the course to be challenged and pay tuition. There is no extra charge for full-time students who are taking at least 16 credit hours. 2. Present evidence of proficiency, complete the written request form and have the request approved prior to the 10 percent point of the semester. 3. Remain enrolled and attend class until the examination is administered. During this period, students who have written approval for the exam may attend class without purchasing textbooks and materials. If books are purchased and returned for refund, they must be in new condition. Students who are very confident of passing the exam may request a course overload. Students who perform on the exam at a level sufficient to get credit may leave the course and will be awarded a grade of “A” or “B” for the course. Receiving credit does not entitle the student to a tuition refund. Students who do not receive credit by examination must remain in the class and complete all course requirements to earn credit at the end of the semester. Students who receive financial assistance of any type are required to inform the director of their assistance program that they are seeking credit by exam. Assistance may be reduced and reimbursement will be required if the course load is reduced by receiving credit by examination. Any exceptions to these procedures must have prior written approval by the appropriate department chairperson, division dean and the Vice President for Instructional Services. Curriculum Course Repetition Students who need a course to graduate may take the course as many times as necessary to pass it, providing space is available. Any course that has been passed or audited may not be taken for credit or audited more than twice per academic year subject to space being available after registration. The twice-per-year regulation also applies to single or elective courses that are not required for graduation. No single physical education course may be attempted more than twice. If a student has a failing grade in a required course, the course must be passed prior to graduation. If a student fails a prerequisite course, it must be repeated successfully before beginning the next course. This could result in the student being enrolled for a longer period than is normally required to complete requirements for graduation.",
    "estimatedTokens": 796
  },
  {
    "pageNumber": 34,
    "text": "cal education course may be attempted more than twice. If a student has a failing grade in a required course, the course must be passed prior to graduation. If a student fails a prerequisite course, it must be repeated successfully before beginning the next course. This could result in the student being enrolled for a longer period than is normally required to complete requirements for graduation. As courses are repeated, the higher grade becomes the official grade. Only a grade of “D” or above can replace an existing grade. 31 • 2025-2026 Student Handbook and Calendar Final Evaluations Each instructor will schedule a comprehensive final course evaluation at some point during the last five days of the semester or the last two days of the class. The evaluation may consist of one or multiple components or methods. The course syllabus will indicate the date(s) and method(s) of evaluation. If the final evaluation is given prior to the last day of class, the syllabus will reflect the class activities to take place after the final evaluation. Students are required to take their final examinations at the time(s) and place(s) scheduled. Conflicts may be resolved by arrangement with the faculty member. Three examinations scheduled for the same day is considered a conflict. Program Completion and Commencement Degrees and Diplomas: The College holds a Commencement ceremony in May of each academic year for degree and diploma students. All students who have completed a degree or diploma during the Fall, or are on track to complete in the Spring or Summer, are invited to participate if they have submitted an “Application for Program Completion.” The application deadlines for the 2025-2026 academic year are October 3 for fall completers and February 6 for spring and summer completers. Submitting the application by this deadline ensures your name will appear in the May Commencement program booklet (degree and diploma students only). Certificates: The College holds an Academic Achievement Ceremony two times a year to recognize certificate students who finished in the previous term. To complete a program, students must meet the following minimum requirements: Declare an academic major and complete the requirements of a College-approved program of study according to the student’s official catalog. The official catalog is determined by the program chair in consultation with the student and should be the catalog that is in effect at the time that the student declares a major. The official catalog may not be a catalog prior to the student’s first date of enrollment and must be a College catalog dated no more than five academic years prior to the date of graduation (i.e. a student completing in Spring or Summer 2025 cannot use a catalog earlier than 2020-2021). Students should be aware that prerequi- sites for courses change frequently and that they will be required to meet the prerequisites in place at the time a course is taken. Each course in the program of study must be completed by one of the following methods: Take the course at A-B Tech. Receive transfer credit.",
    "estimatedTokens": 776
  },
  {
    "pageNumber": 35,
    "text": "dent completing in Spring or Summer 2025 cannot use a catalog earlier than 2020-2021). Students should be aware that prerequi- sites for courses change frequently and that they will be required to meet the prerequisites in place at the time a course is taken. Each course in the program of study must be completed by one of the following methods: Take the course at A-B Tech. Receive transfer credit. To be eligible for completion, at least 25% of the required program hours must be completed at A-B Tech. The following programs require that selected upper-level courses be completed in residency at A-B Tech: Associate Degree Nursing, Basic Law Enforcement Training, Cardio Sonography, Dental Assisting, Den - tal Hygiene, Emergency Medical Science, Medical Assisting, Medical Laboratory Technology, Medical Sonography, Practical Nursing, Radiography, Surgical Technology, Veterinary Medical Technology, and Cosmetology. A student who desires to transfer credit into one of these programs should consult with the department chairperson. Exceptions may be approved by the Vice President for Instructional Services. Requirements for Graduation Earn a grade of at least “C” in each course identified in the catalog as a major course and a minimum average of 2.0 (“C”) quality points for the current program. Students completing their program of study with a program grade point average of 4.0 will be graduated with. 2025-2026 Student Handbook and Calendar • 32 highest honors. Those who have a minimum program GPA of 3.75 will be graduated with high honors, and those with a minimum program GPA of 3.50 will be graduated with honors. Honors will only be awarded after the student’s program requirements have been completed; students completing their program requirements in the summer semester will not receive honors recognition during the Commencement ceremony in May. The student must assume primary responsibility for assuring that all requirements for graduation are met. Apply for program completion at by visiting the Records and Registration webpage for next steps. If you have questions about this process visit the K. Ray Bailey Student Services Center or email registrar@abtech.edu . The application should be submitted the semester before completing program requirements. An Application for Completion is required even if you do not plan to attend the Commencement ceremony. Otherwise, your degree, diploma, or certifi - cate cannot be posted to your academic record. Applicants for graduation must be in good standing, fulfill all financial obligations to the College including library and parking fines and fulfill programmatic-related graduation require - ments as defined by special accreditation compliance standards. Grading System Final grades will be issued to all students at the end of the term based on the criteria outlined in the course syllabus. A student who wants to contest a grade must do so within six weeks of the awarding of the grade. A grade cannot be changed after this period without approval by the department chair and the division dean.",
    "estimatedTokens": 769
  },
  {
    "pageNumber": 36,
    "text": "as defined by special accreditation compliance standards. Grading System Final grades will be issued to all students at the end of the term based on the criteria outlined in the course syllabus. A student who wants to contest a grade must do so within six weeks of the awarding of the grade. A grade cannot be changed after this period without approval by the department chair and the division dean. Students will be graded by the following system: A Excellent academic performance, consistent mastery of facts and concepts, and a thorough understanding of course content. B Good academic performance, high-level mastery of course content. C Average academic performance. D Marginal academic performance, poor mastery of course content. F Very poor performance, no demonstration of even minimal mastery of course content. I Incomplete Assigned when a student is unable to complete work or take a final examination because of illness or other reasons over which the student has no control. An incomplete grade must be completed within the first six weeks of the next semester. Otherwise, the grade becomes an “F.” P Proficiency Does not affect quality point ratio. R Retake Proficiency not demonstrated. Class must be retaken. Does not affect quality point ratio. W Official Withdrawal (no GPA penalty) Assigned when the student OFFICIALLY WITHDRAWS. This will not influence the quality point ratio. Official withdrawals are not allowed after the 75% point of a semester or term, as identified in the official college calendar, except for exceptional and documented emergencies. In such circumstances, the student must withdraw from all courses. Approval for an emergency withdrawal must come from the Registrar or his or her designee. 33 • 2025-2026 Student Handbook and Calendar IE Incomplete Emergency Assigned during a term when the College has been impacted by a natural disaster, pandemic or other circumstance that is deemed as a College-wide emergency. An incomplete emergency grade must be completed within one calendar year from the date assigned or by an alternate date approved by the Vice President of Instructional Services. Otherwise, the grade becomes a “WE.” WE Withdrawal Emergency Assigned during a term when the College has been impacted by a natural disaster, pandemic or other circumstance that is deemed as a College-wide emergency. “WE” is assigned when a student OFFICIALLY WITHDRAWS. It is processed and impacts the student record in the same way that a “W” grade does. Transcript Codes Other codes that may appear on the college transcript include: AP Advanced Placement course credit. AR North Carolina High School to Community College Articulation Agreement course credit. CR CLEP (College Level Examination Program) course credit, or other academic credit applied from non-course activity. NS No Show. Student enrolled but didn’t attend the course during the first 10% of the term. This will not influence the quality point ratio. T/TR Transfer credit from other colleges, universities, and military credit. Y Audit. To Compute the Quality Point Average At the end of each semester quality points are assigned in accordance with the following formula.",
    "estimatedTokens": 796
  },
  {
    "pageNumber": 37,
    "text": "edit applied from non-course activity. NS No Show. Student enrolled but didn’t attend the course during the first 10% of the term. This will not influence the quality point ratio. T/TR Transfer credit from other colleges, universities, and military credit. Y Audit. To Compute the Quality Point Average At the end of each semester quality points are assigned in accordance with the following formula. (The minimum program grade-point ratio for graduation is 2.00 or an average of grade “C.”) A 4 quality points per credit hour B 3 quality points per credit hour C 2 quality points per credit hour D 1 quality point per credit hour F no quality points The grade-point average (GPA) is determined by dividing the total number of quality points by the number of hours attempted (excluding grades of “I”, “IE”, “P”, “R”, “W”, “WE”). A grade-point average of 2.00 indicates that a student has an average of “C.” Student Rights and Responsibilities A-B Tech is fully committed to providing a learning environment that is safe, nurturing, and free from prohibited discrimination. While advisors, deans, instructors, administrators, and other College officials assist students in becoming acquainted with College regulations, including rights and responsibilities; ultimately, students must assume final responsibility for being acquainted with College policy and procedures. A-B Tech recognizes the rights of. 2025-2026 Student Handbook and Calendar • 34 students and is dedicated to resolving student complaints in a timely, fair, and reasonable manner as outlined in this section of the catalog. Any student, including those participat - ing in online/distance courses and high school dual enrollment courses offered at any A-B Tech site may file a complaint and request a review. Students unable to attend hearings in person may request electronic options throughout the respective appeal process. For the most up-to-date version of College policies and procedures, please visit abtech.edu .",
    "estimatedTokens": 497
  },
  {
    "pageNumber": 39,
    "text": "og. Any student, including those participat - ing in online/distance courses and high school dual enrollment courses offered at any A-B Tech site may file a complaint and request a review. Students unable to attend hearings in person may request electronic options throughout the respective appeal process. For the most up-to-date version of College policies and procedures, please visit abtech.edu . College Policies and Procedures: Non-Discrimination and Harassment Policy Non-Discrimination and Harassment Procedure Privacy of Student Records Policy Privacy of Student Records Procedure Student Complaints Grade Appeals Policy Grade Appeals Procedure Student Appeals Policy Student Appeals Procedure Code of Classroom Conduct (page 50 of A-B Tech Catalog) Code of Student Conduct Policy Code of Student Conduct Procedure Student Rights of Due Process Policy Student Rights of Due Process P rocedure Threat Assessment Policy Threat Assessment Procedure Sexual Misconduct Policy Sexual Misconduct Procedure Title IX Sexual Harassment Procedure Drug and Alcohol Policy Drug and Alcohol Procedure Tobacco Free Campus Policy Weapons on Campus Policy Workplace Violence Prevention Policy Workplace Violence Prevention Procedure Students with Disabilities Animals on Campus Procedure Communicable Disease and Occupational Exposure to Bloodborne Pathogens Policy Communicable Disease and Occupational Exposure to Bloodborne Pathogens Procedure Free Speech, Distribution of Materials , and Assembly Policy Free Speech, Distribution of Materials , and Assembly P rocedure Internet and Campus Network Acceptable Use Policy Internet and Campus Network Acceptable Use P rocedure Intellectual Property Policy Intellectual Property Procedure. 35 • 2025-2026 Student Handbook and Calendar College Calendar 2025-2026 — At a Glance Fall Semester – 2025 Registration Begins for Current/Returning Students March 31 Registration Begins for New Students June 16 First Payment Deadline August 14 Second Payment Deadline August 21 Classes Begin August 25 8-Week Term I August 25 – October 20 Labor Day Student Break August 30 - September 1 Labor Day (College Closed) September 1 Professional Development Day (No Classes for Students) October 21 8-Week Term II October 22 – December 20 Thanksgiving Student Break (No Classes for Students) November 26 - November 29 Thanksgiving Holiday (College Closed) November 27 College Closed November 28 Last Day of Class December 20 Winter College Break (No Classes for Students) December 22 - January 10 College Closed December 24 Winter College Holiday (College Closed) December 25, 26, 29, 30, 31, January 1, 2 Fall 16-week term contains 15 Saturdays For most up to date payment deadlines please visit: abtech.edu/becoming-student/financial-aid/financial-aid-dates-deadlines. 2025-2026 Student Handbook and Calendar • 36 * Up to three days may be made up at the end of the semester for inclement weather.",
    "estimatedTokens": 731
  },
  {
    "pageNumber": 41,
    "text": "llege Closed December 24 Winter College Holiday (College Closed) December 25, 26, 29, 30, 31, January 1, 2 Fall 16-week term contains 15 Saturdays For most up to date payment deadlines please visit: abtech.edu/becoming-student/financial-aid/financial-aid-dates-deadlines. 2025-2026 Student Handbook and Calendar • 36 * Up to three days may be made up at the end of the semester for inclement weather. For most up to date payment deadlines please visit: abtech.edu/becoming-student/financial-aid/financial-aid-dates-deadlines Spring Semester –2026 First Payment Deadline December 11, 2025 Second Payment Deadline January 8 Classes Begin January 12 8-Week Term I January 12 – March 9 Martin Luther King Jr. Student Break January 17 - January 19 Martin Luther King Jr. Day College Holiday (College Closed) January 19 Professional Development Day (no classes for students) March 10 8-Week Term II March 11 – May 12 Student Spring Break (No Classes for Students) April 6 - April 11 Last Day of Class May 12 Spring Commencement May 16 Summer Semester – 2026 Registration Begins for Current/Returning Students April 13 Registration Begins for New Students April 20 Payment Deadline May 14 10-Week Term May 22 – Aug. 3 Memorial Day Holiday May 25 8-Week Term June 5 – July 31 Independence Day (Student Break) July 3 Independence Day College Holiday (College Closed) July 3 8-Week Term Last Day of Classes July 31 10-Week Term Last Day of Classes August 3. 37 • 2025-2026 Student Handbook and Calendar. 340 Victoria Road / Asheville, NC 28801 Asheville-Buncombe Technical Community College is accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award associate degrees. Asheville-Buncombe Technical Community College also may offer credentials such as certificates and diplomas at approved degree levels. Questions about the accreditation of Asheville-Buncombe Technical Community College may be directed in writing to the Southern Association of Colleges and Schools Commission on Colleges at 1866 Southern Lane, Decatur, GA 30033-4097, by calling (404) 679-4500, or by using information available on SACSCOC’s website (www.sacscoc.org). Equal Opportunity Educational Institution.",
    "estimatedTokens": 555
  }
]